{
  "_commit_hash": "25216a913fa218ccb7d58cce818d52b728b6c1f6",
  "_name_or_path": "LiheYoung/depth-anything-small-hf",
  "architectures": [
    "DepthAnythingForDepthEstimation"
  ],
  "backbone": null,
  "backbone_config": {
    "architectures": [
      "Dinov2Model"
    ],
    "hidden_size": 384,
    "image_size": 518,
    "model_type": "dinov2",
    "num_attention_heads": 6,
    "out_features": [
      "stage9",
      "stage10",
      "stage11",
      "stage12"
    ],
    "out_indices": [
      9,
      10,
      11,
      12
    ],
    "patch_size": 14,
    "reshape_hidden_states": false,
    "torch_dtype": "float32"
  },
  "backbone_kwargs": null,
  "fusion_hidden_size": 64,
  "head_hidden_size": 32,
  "head_in_index": -1,
  "initializer_range": 0.02,
  "model_type": "depth_anything",
  "neck_hidden_sizes": [
    48,
    96,
    192,
    384
  ],
  "patch_size": 14,
  "reassemble_factors": [
    4,
    2,
    1,
    0.5
  ],
  "reassemble_hidden_size": 384,
  "torch_dtype": "float32",
  "transformers_version": null,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false
}
